In [1]:
import pandas as pd
import numpy as np

In [2]:
pwd

'/home/marco/Documents/training_ml'

In [5]:
pd.read_csv('../Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas/example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [25]:
pd.read_csv('../Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas/multi_index_example')

,first,bar,bar.1,baz,baz.1,foo,foo.1,qux,qux.1
0,second,one,two,one,two,one,two,one,two
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,A,1.025984152081572,-0.1565979042889875,-0.031579143908112575,0.6498258334908454,2.154846443259472,-0.6102588558227414,-0.755325340010558,-0.34641850351854453
3,B,0.1470267713241236,-0.47944803904109595,0.558769406443067,1.0248102783372157,-0.925874258809907,1.8628641384939535,-1.1338171615837889,0.6104779075384634
4,C,0.3860303121135517,2.084018530338962,-0.37651867524923904,0.23033634359240704,0.6812092925867574,1.0351250747739213,-0.031160481493099617,1.9399323109926203

In [26]:
data = pd.read_html('https://www.w3schools.com/html/html_tables.asp')

In [27]:
df = data[0]

# essa solução não é considerada ideal par ler SQL
    para ler SQL, é recomendável pesquisar a biblioteca específica para o banco que você está trabalhando. Pandas não é a melhor ferramenta para isso, ele apenas quebra um galho

    Ex:
    postres -> psycopg2
    mysql -> pymysql

In [29]:
from sqlalchemy import create_engine

engine = create_engine('sqlite:///:memory:')
df.to_sql('data', engine)
sql_df = pd.read_sql('data',con=engine)
sql_df

   index                       Company           Contact  Country
0      0           Alfreds Futterkiste      Maria Anders  Germany
1      1    Centro comercial Moctezuma   Francisco Chang   Mexico
2      2                  Ernst Handel     Roland Mendel  Austria
3      3                Island Trading     Helen Bennett       UK
4      4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5      5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy